test_data = [
    # Test case 1: Normal data
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 06.05.2024 6",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 8.5",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 06.05.2024 9",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 07.05.2024 9",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 07.05.2024 7",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 07.05.2024 8",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 8.5",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 8",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 08.05.2024 10",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 08.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 08.05.2024 8"
        ],
        [
            "Петров А.С. -3",
            "Журавлева Е.А. +4",
        ]
    ],

    # Test case 2: Same full name but different UIDs
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 40",
            "b5e8f9a6-9e65-4c26-a464-efcc0fd98c4d Пванов Иван Иванович 07.05.2024 39",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 8.5",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 8",
        ],
        [
            "Сорокина А.П. -7.5",
            "Иванов И.И. +16",
            "Пванов И.И. +15",

        ]
    ],
    # Test case 3: One person
    [
        [
            "5",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 40",
        ],
        [
            "Иванов И.И. +35",
        ]
    ],

    # Test case 4: exactly 10 percent
    [
        [
            "5",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 4.5",
        ],
        [
        ]
    ],

    # Test case 5: No imbalance
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 06.05.2024 8",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 8",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 06.05.2024 8",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 07.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 07.05.2024 8",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 8",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 07.05.2024 8",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 08.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 08.05.2024 8",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 8",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 08.05.2024 8",
        ],
        []
    ],

    # Test case 6: All imbalance (CHECK SORT)
    [
        [
            "24",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 06.05.2024 2",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 26",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 06.05.2024 18",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 07.05.2024 21",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 07.05.2024 2",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 26",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 07.05.2024 18",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 08.05.2024 2",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 26",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 08.05.2024 18",
        ],
        [
            "Иванов И.И. -3",
            "Петров А.С. -18",
            "Журавлева Е.А. +30",
            "Сорокина А.П. +54"
        ]
    ],

    # Test case 7: Incorrect format in some lines
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 24",
            "incorrect format line",
            "b5e8f9a6-9e65-4c26-a464-efcc0fd98c4d Петров Алексей Сергеевич 06.05.2024 18",
        ],
        [
            "Петров А.С. -6",
        ]
    ],

    # Test case 8: All employees with positive imbalance
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 30",
            "b5e8f9a6-9e65-4c26-a464-efcc0fd98c4d Петров Алексей Сергеевич 06.05.2024 28",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 26",
        ],
        [
            "Иванов И.И. +6",
            "Петров А.С. +4",
        ]
    ],

    # Test case 10: incorrect number
    [
        [
            "not a number",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 20",
            "b5e8f9a6-9e65-4c26-a464-efcc0fd98c4d Петров Алексей Сергеевич 06.05.2024 18",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 16",
        ],
        [
        ]
    ],

    # Test case 11: no data in report
    [
        [
            "5",
        ],
        [
        ]
    ],

    # Test case 12: empty report
    [
        [
        ],
        [
        ]
    ],
]
