test_data = [
    # Test case 1: Normal data
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 06.05.2024 6",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 06.05.2024 8.5",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 06.05.2024 9",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 07.05.2024 9",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 07.05.2024 7",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 07.05.2024 8",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 8.5",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 8",
            "e5dbc47c-52f6-480a-876d-f97b17cb7cab Журавлева Елена Анатольевна 08.05.2024 10",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 08.05.2024 8",
            "0f0ccd5e-cd46-462a-b92d-69a6ff147465 Петров Алексей Сергеевич 08.05.2024 8"
        ],
        [
            "Журавлева Е.А. 4",
            "Петров А.С. -3"
        ]
    ],

    # Test case 2: Same full name but different UIDs
    [
        [
            "24",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 40",
            "b5e8f9a6-9e65-4c26-a464-efcc0fd98c4d Иванов Иван Иванович 07.05.2024 39",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 07.05.2024 8.5",
            "75cd02d8-6b1f-42fb-9c59-7db675b28a2d Сорокина Анна Павловна 08.05.2024 8",
        ],
        [
            "Иванов И.И. 16",
            "Иванов И.И. 15",
            "Сорокина А.П. -7.5"
        ]
    ],
    [
        [
            "5",
            "a30b4d51-11b4-49b2-b356-466e92a66df7 Иванов Иван Иванович 06.05.2024 40",
        ],
        [
            "Иванов И.И. 35",
        ]
    ],
]